# Data Wrangling: Join, Combine, and Reshape

In many applications, data may be spread across a number of files or databases or be arranged in a form that is not easy to analyze. This chapter focus on tools to help combine, join, and rearrange data.

In [1]:
import pandas as pd
import numpy as np

## Hierarchical Indexing

In [2]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                      [1,2,3,1,3,1,2,2,3]])

In [3]:
data

a  1    0.000139
   2   -1.474000
   3   -0.324000
b  1   -0.958132
   3   -0.757158
c  1    0.140445
   2    0.199829
d  2    1.116983
   3    0.875602
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
data['b']

1   -0.958132
3   -0.757158
dtype: float64

In [6]:
data['b':'c']

b  1   -0.958132
   3   -0.757158
c  1    0.140445
   2    0.199829
dtype: float64

In [7]:
data.loc[['b','c']]

b  1   -0.958132
   3   -0.757158
c  1    0.140445
   2    0.199829
dtype: float64

In [8]:
data.loc[:,2]

a   -1.474000
c    0.199829
d    1.116983
dtype: float64

In [9]:
data.unstack()

          1         2         3
a  0.000139 -1.474000 -0.324000
b -0.958132       NaN -0.757158
c  0.140445  0.199829       NaN
d       NaN  1.116983  0.875602

In [10]:
data.unstack().stack()

a  1    0.000139
   2   -1.474000
   3   -0.324000
b  1   -0.958132
   3   -0.757158
c  1    0.140445
   2    0.199829
d  2    1.116983
   3    0.875602
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['Ohio','Ohio','Colorado'],
                            ['Green','Red','Green']])

In [12]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ['key1','key2']

In [14]:
frame.columns.names = ['state','color']

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and Sorting Levels

In [17]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [18]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

### Summary Statistics by Level

In [19]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [20]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

In [21]:
frame = pd.DataFrame({'a': range(7), 'b': range(7,0,-1),
                     'c': ['one','one','one','two','two',
                          'two','two'],
                     'd': [0,1,2,0,1,2,3]})

In [22]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [23]:
frame2 = frame.set_index(['c','d'])

In [24]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

## Combining and Merging Datasets

### Database-Style DataFrame Joins

### Merging on Index

### Concatenating Along an Axis

### Combining Data with Overlap

## Reshaping and Pivoting

### Reshaping with Hierachical Indexing

### Pivoting "Long" to "Wide" Format

### Pivoting "Wide" to "Long" Format